# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'mackup'
brew 'node'
brew 'wget'

# PHP
brew 'php70', args: ['with-debug', 'without-apache']

# Apps
cask '1password'
cask 'appcleaner'
cask 'avira-antivirus'
cask 'awareness'
cask 'bartender'
cask 'battery-guardian'
cask 'bitbar'
cask 'cakebrew'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'gitkraken'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'macdown'
cask 'monolingual'
cask 'pgadmin3'
cask 'radiant-player'
cask 'screenflick'
cask 'screenhero'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sqlprosqlite'
cask 'sublime-text3'
cask 'steam'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'toggldesktop'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Quicklookp
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-fira-code'
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'